<a href="https://colab.research.google.com/github/avs20/SioLabsPython0/blob/main/19_Pandas_To_the_End.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd 
data = pd.read_csv('train.csv')
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [2]:
# how to rename a column
data.rename(columns  = {
    'Pclass' : 'TravelClass'
    })

     PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
0              1         0            3  ...   7.2500   NaN         S
1              2         1            1  ...  71.2833   C85         C
2              3         1            3  ...   7.9250   NaN         S
3              4         1            1  ...  53.1000  C123         S
4              5         0            3  ...   8.0500   NaN         S
..           ...       ...          ...  ...      ...   ...       ...
886          887         0            2  ...  13.0000   NaN         S
887          888         1            1  ...  30.0000   B42         S
888          889         0            3  ...  23.4500   NaN         S
889          890         1            1  ...  30.0000  C148         C
890          891         0            3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [3]:
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [4]:

data_copy = data.rename(columns  = {
    'Pclass' : 'TravelClass'
    })

data_copy.head()

   PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
0            1         0            3  ...   7.2500   NaN         S
1            2         1            1  ...  71.2833   C85         C
2            3         1            3  ...   7.9250   NaN         S
3            4         1            1  ...  53.1000  C123         S
4            5         0            3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
data_copy[1:4]

   PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
1            2         1            1  ...  71.2833   C85         C
2            3         1            3  ...   7.9250   NaN         S
3            4         1            1  ...  53.1000  C123         S

[3 rows x 12 columns]

In [6]:
# how to do inplace 

# how to rename a column
data.rename(columns  = {
    'Pclass' : 'TravelClass'
    } , inplace = True)   # no copy is made, the data is changed here only 

data.head()

   PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
0            1         0            3  ...   7.2500   NaN         S
1            2         1            1  ...  71.2833   C85         C
2            3         1            3  ...   7.9250   NaN         S
3            4         1            1  ...  53.1000  C123         S
4            5         0            3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [7]:
data.head()

   PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
0            1         0            3  ...   7.2500   NaN         S
1            2         1            1  ...  71.2833   C85         C
2            3         1            3  ...   7.9250   NaN         S
3            4         1            1  ...  53.1000  C123         S
4            5         0            3  ...   8.0500   NaN         S

[5 rows x 12 columns]

inplace = True 
------

don't make the copy, work on original data.

In [8]:
data.rename(columns  = {
    'Pclass' : 'TravelClass',
    'Parch' : 'Parent & Children',
    'SibSp' : 'Siblings & Spouse'
    } , inplace = True)   

data.head()

   PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
0            1         0            3  ...   7.2500   NaN         S
1            2         1            1  ...  71.2833   C85         C
2            3         1            3  ...   7.9250   NaN         S
3            4         1            1  ...  53.1000  C123         S
4            5         0            3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [10]:
data['Siblings & Spouse']

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: Siblings & Spouse, Length: 891, dtype: int64

In [11]:
data.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [12]:
data.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [13]:
data.Embarked

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [14]:
data.Siblings & Spouse

AttributeError: ignored

In [15]:
data.Age < 13

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [16]:
data[ data.Age < 13]

     PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
7              8         0            3  ...  21.0750   NaN         S
10            11         1            3  ...  16.7000    G6         S
16            17         0            3  ...  29.1250   NaN         Q
24            25         0            3  ...  21.0750   NaN         S
43            44         1            2  ...  41.5792   NaN         C
..           ...       ...          ...  ...      ...   ...       ...
827          828         1            2  ...  37.0042   NaN         C
831          832         1            2  ...  18.7500   NaN         S
850          851         0            3  ...  31.2750   NaN         S
852          853         0            3  ...  15.2458   NaN         C
869          870         1            3  ...  11.1333   NaN         S

[69 rows x 12 columns]

Missing Values
-------

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   PassengerId        891 non-null    int64
 1   Survived           891 non-null    int64
 2   TravelClass        891 non-null    int64
 3   Name               891 non-null    object
 4   Sex                891 non-null    object
 5   Age                714 non-null    float64
 6   Siblings & Spouse  891 non-null    int64
 7   Parent & Children  891 non-null    int64
 8   Ticket             891 non-null    object
 9   Fare               891 non-null    float64
 10  Cabin              204 non-null    object
 11  Embarked           889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [18]:
891 - 714

177

In [19]:
# null values or nan values

In [20]:
# isna() - > return true if the values is missing else returns false 
data.Age.isna()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [21]:
data[data.Age.isna()]

     PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
5              6         0            3  ...   8.4583   NaN         Q
17            18         1            2  ...  13.0000   NaN         S
19            20         1            3  ...   7.2250   NaN         C
26            27         0            3  ...   7.2250   NaN         C
28            29         1            3  ...   7.8792   NaN         Q
..           ...       ...          ...  ...      ...   ...       ...
859          860         0            3  ...   7.2292   NaN         C
863          864         0            3  ...  69.5500   NaN         S
868          869         0            3  ...   9.5000   NaN         S
878          879         0            3  ...   7.8958   NaN         S
888          889         0            3  ...  23.4500   NaN         S

[177 rows x 12 columns]

In [22]:
data.Age.isna().sum()

177

In [24]:
data.Age.isna().count()

891

In [28]:
data.Age.isna().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [29]:
data[data.Age.isna()]

     PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
5              6         0            3  ...   8.4583   NaN         Q
17            18         1            2  ...  13.0000   NaN         S
19            20         1            3  ...   7.2250   NaN         C
26            27         0            3  ...   7.2250   NaN         C
28            29         1            3  ...   7.8792   NaN         Q
..           ...       ...          ...  ...      ...   ...       ...
859          860         0            3  ...   7.2292   NaN         C
863          864         0            3  ...  69.5500   NaN         S
868          869         0            3  ...   9.5000   NaN         S
878          879         0            3  ...   7.8958   NaN         S
888          889         0            3  ...  23.4500   NaN         S

[177 rows x 12 columns]

In [31]:
data[data.Age.isnull()]

     PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
5              6         0            3  ...   8.4583   NaN         Q
17            18         1            2  ...  13.0000   NaN         S
19            20         1            3  ...   7.2250   NaN         C
26            27         0            3  ...   7.2250   NaN         C
28            29         1            3  ...   7.8792   NaN         Q
..           ...       ...          ...  ...      ...   ...       ...
859          860         0            3  ...   7.2292   NaN         C
863          864         0            3  ...  69.5500   NaN         S
868          869         0            3  ...   9.5000   NaN         S
878          879         0            3  ...   7.8958   NaN         S
888          889         0            3  ...  23.4500   NaN         S

[177 rows x 12 columns]

In [33]:
data.isnull().sum()

PassengerId            0
Survived               0
TravelClass            0
Name                   0
Sex                    0
Age                  177
Siblings & Spouse      0
Parent & Children      0
Ticket                 0
Fare                   0
Cabin                687
Embarked               2
dtype: int64

In [34]:
data.isna().sum()

PassengerId            0
Survived               0
TravelClass            0
Name                   0
Sex                    0
Age                  177
Siblings & Spouse      0
Parent & Children      0
Ticket                 0
Fare                   0
Cabin                687
Embarked               2
dtype: int64

How to remove missing values ?
-----
1. Remove the rows which contain missing values

In [35]:
data.isnull()

     PassengerId  Survived  TravelClass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False        False  False  ...   False  False   True     False
1          False     False        False  False  ...   False  False  False     False
2          False     False        False  False  ...   False  False   True     False
3          False     False        False  False  ...   False  False  False     False
4          False     False        False  False  ...   False  False   True     False
..           ...       ...          ...    ...  ...     ...    ...    ...       ...
886        False     False        False  False  ...   False  False   True     False
887        False     False        False  False  ...   False  False  False     False
888        False     False        False  False  ...   False  False   True     False
889        False     False        False  False  ...   False  False  False     False
890        False     False        False  False  ...   False  False   True     False

[891 rows x 12 columns]

In [36]:
data.iloc[888,]

PassengerId                                               889
Survived                                                    0
TravelClass                                                 3
Name                 Johnston, Miss. Catherine Helen "Carrie"
Sex                                                    female
Age                                                       NaN
Siblings & Spouse                                           1
Parent & Children                                           2
Ticket                                             W./C. 6607
Fare                                                    23.45
Cabin                                                     NaN
Embarked                                                    S
Name: 888, dtype: object

In [37]:
# how to find rows where at least 1 value is missing

In [39]:
data.isna().sum()

PassengerId            0
Survived               0
TravelClass            0
Name                   0
Sex                    0
Age                  177
Siblings & Spouse      0
Parent & Children      0
Ticket                 0
Fare                   0
Cabin                687
Embarked               2
dtype: int64

In [40]:
data.isna().sum(axis = 1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [53]:
rows_without_missing_values = data.isna().sum(axis = 1) <= 0

In [54]:
data.loc[ ~rows_without_missing_values , :]

     PassengerId  Survived  TravelClass  ...     Fare Cabin  Embarked
0              1         0            3  ...   7.2500   NaN         S
2              3         1            3  ...   7.9250   NaN         S
4              5         0            3  ...   8.0500   NaN         S
5              6         0            3  ...   8.4583   NaN         Q
7              8         0            3  ...  21.0750   NaN         S
..           ...       ...          ...  ...      ...   ...       ...
884          885         0            3  ...   7.0500   NaN         S
885          886         0            3  ...  29.1250   NaN         Q
886          887         0            2  ...  13.0000   NaN         S
888          889         0            3  ...  23.4500   NaN         S
890          891         0            3  ...   7.7500   NaN         Q

[708 rows x 12 columns]

In [57]:
data.loc[ rows_without_missing_values , :].isna().sum()

PassengerId          0
Survived             0
TravelClass          0
Name                 0
Sex                  0
Age                  0
Siblings & Spouse    0
Parent & Children    0
Ticket               0
Fare                 0
Cabin                0
Embarked             0
dtype: int64

In [59]:
# easy solution to drop rows with missing values 
data.dropna() 

# by default it will remove all rows where any 1 value is missing.

     PassengerId  Survived  TravelClass  ...     Fare        Cabin  Embarked
1              2         1            1  ...  71.2833          C85         C
3              4         1            1  ...  53.1000         C123         S
6              7         0            1  ...  51.8625          E46         S
10            11         1            3  ...  16.7000           G6         S
11            12         1            1  ...  26.5500         C103         S
..           ...       ...          ...  ...      ...          ...       ...
871          872         1            1  ...  52.5542          D35         S
872          873         0            1  ...   5.0000  B51 B53 B55         S
879          880         1            1  ...  83.1583          C50         C
887          888         1            1  ...  30.0000          B42         S
889          890         1            1  ...  30.0000         C148         C

[183 rows x 12 columns]

In [60]:
data.isna().sum()

PassengerId            0
Survived               0
TravelClass            0
Name                   0
Sex                    0
Age                  177
Siblings & Spouse      0
Parent & Children      0
Ticket                 0
Fare                   0
Cabin                687
Embarked               2
dtype: int64

In [61]:
data.dropna(inplace = True)

In [62]:
data.isna().sum()

PassengerId          0
Survived             0
TravelClass          0
Name                 0
Sex                  0
Age                  0
Siblings & Spouse    0
Parent & Children    0
Ticket               0
Fare                 0
Cabin                0
Embarked             0
dtype: int64

In [63]:
data.shape

(183, 12)

In [64]:
data = pd.read_csv('train.csv')
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [65]:
# 1 bhi missing hai to hata rha hai 
# saari missing hai to hata rha hai 
# data.dropna(axis = 1, how = 'any' )

In [66]:
data.Age.isna()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [68]:
rows_with_age_not_missing = ~data.Age.isna()
df_with_age = data[rows_with_age_not_missing]

In [70]:
df_with_age.Age.isna().sum()

0

In [71]:
rows_with_age_not_missing = ~data.Age.isna()
df_with_age = data[rows_with_age_not_missing]

df_with_age

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[714 rows x 12 columns]

In [72]:
df_with_age.Age.isna().sum()

0

How to remove missing values ?
-----
2. Fill the missing values with something

In [73]:
177/ 891 * 100

19.865319865319865

In [74]:
data = pd.read_csv('train.csv')
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [75]:
data.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [77]:
# find all rows where age is missing 
rows_with_missing_age = data.Age.isna()
data[rows_with_missing_age].head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
5             6         0       3  ...   8.4583   NaN         Q
17           18         1       2  ...  13.0000   NaN         S
19           20         1       3  ...   7.2250   NaN         C
26           27         0       3  ...   7.2250   NaN         C
28           29         1       3  ...   7.8792   NaN         Q

[5 rows x 12 columns]

In [78]:

# in the age column of those rows, set the value of age  as 29.69

data.loc[rows_with_missing_age, 'Age'] = 29.69

In [79]:
data[rows_with_missing_age].head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
5             6         0       3  ...   8.4583   NaN         Q
17           18         1       2  ...  13.0000   NaN         S
19           20         1       3  ...   7.2250   NaN         C
26           27         0       3  ...   7.2250   NaN         C
28           29         1       3  ...   7.8792   NaN         Q

[5 rows x 12 columns]

Aalsi

In [80]:
data = pd.read_csv('train.csv')
data.head()
data.Age.isna().sum()

177

In [82]:
data.Age.fillna(data.Age.mean(), inplace = True )

In [83]:
data.Age.isna().sum()

0

In [84]:
data.iloc[5,:]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                     29.6991
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

How to replace non-numeric values?

In [85]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

1. Fill with the most common value present. 
2. Fill with the value in accordance with other features / columns.

In [ ]:
# mean age of females was lower than that of male. 

# age missing 

# check whether it's male or female. 

# fill with male's mean age or female's mean age

In [86]:
data.groupby('Sex')['Age'].mean()

Sex
female    28.216730
male      30.505824
Name: Age, dtype: float64